## Weekly Assignment 1 - Pandas

1. Create a pandas DataFrame from the CSV and from Python lists/dicts.

In [1]:
import pandas as pd

# create DF from csv file 
# generated 1000 rows for data variety in "transactions_1000_rows.csv"
df = pd.read_csv(r"C:\Users\Ridhima\ChubbTraining\weekly_assignment1\transactions_1000_rows.csv")
print(df.head())
print(type(df))

   transaction_id  store_id store_name        date  product_id product_name  \
0            1001         3    Airport  12-10-2025         505       Marker
1            1002         2     Suburb  06-10-2025         506  Highlighter
2            1003         2     Suburb  08-10-2025         504       Folder
3            1004         3    Airport  01-10-2025         504       Folder
4            1005         1   Downtown  30-10-2025         506  Highlighter

   quantity  unit_price  total  customer_id promo_code
0         3        1.75   5.25          NaN        NaN
1         2        0.90   1.80       2172.0     DISC10
2         6        1.20   7.20       2134.0        NaN
3         5        1.20   6.00       2137.0     DISC10
4         2        0.90   1.80          NaN     DISC10
<class 'pandas.core.frame.DataFrame'>

In [2]:
# create DF from lists
import numpy as np
data_lists = [
    [1001, 3,  "Airport",  "2025-10-12", 505, "Marker",       3, 1.75, 5.25,   np.nan, None],
    [1002, 2,  "Suburb",   "2025-10-06", 506, "Highlighter",  2, 0.90, 1.80,   2172.0, "DISC10"],
    [1003, 2,  "Suburb",   "2025-10-08", 504, "Folder",       6, 1.20, 7.20,   2134.0, None],
    [1004, 3,  "Airport",  "2025-10-01", 504, "Folder",       5, 1.20, 6.00,   2137.0, "DISC10"],
    [1005, 1,  "Downtown", "2025-10-30", 506, "Highlighter",  2, 0.90, 1.80,   np.nan, "DISC10"]
]

columns = [
    "transaction_id", "store_id", "store_name", "date", "product_id",
    "product_name", "quantity", "unit_price", "total", 
    "customer_id", "promo_code"
]

df_from_lists = pd.DataFrame(data_lists, columns=columns)
print(df_from_lists)

   transaction_id  store_id store_name        date  product_id product_name  \
0            1001         3    Airport  2025-10-12         505       Marker
1            1002         2     Suburb  2025-10-06         506  Highlighter
2            1003         2     Suburb  2025-10-08         504       Folder
3            1004         3    Airport  2025-10-01         504       Folder
4            1005         1   Downtown  2025-10-30         506  Highlighter

   quantity  unit_price  total  customer_id promo_code
0         3        1.75   5.25          NaN       None
1         2        0.90   1.80       2172.0     DISC10
2         6        1.20   7.20       2134.0       None
3         5        1.20   6.00       2137.0     DISC10
4         2        0.90   1.80          NaN     DISC10

In [3]:
# create df from dicts

data_dict = {
    "transaction_id": [1001, 1002, 1003, 1004, 1005],
    "store_id":       [3, 2, 2, 3, 1],
    "store_name":     ["Airport", "Suburb", "Suburb", "Airport", "Downtown"],
    "date":           ["2025-10-12", "2025-10-06", "2025-10-08", "2025-10-01", "2025-10-30"],
    "product_id":     [505, 506, 504, 504, 506],
    "product_name":   ["Marker", "Highlighter", "Folder", "Folder", "Highlighter"],
    "quantity":       [3, 2, 6, 5, 2],
    "unit_price":     [1.75, 0.90, 1.20, 1.20, 0.90],
    "total":          [5.25, 1.80, 7.20, 6.00, 1.80],
    "customer_id":    [np.nan, 2172.0, 2134.0, 2137.0, np.nan],
    "promo_code":     [None, "DISC10", None, "DISC10", "DISC10"]
}

df_from_dict = pd.DataFrame(data_dict)

In [4]:
# basic eda
df.shape # (rows, cols)

(1000, 11)

In [5]:
print(df.index)
print(df.columns)
print(df.info())

RangeIndex(start=0, stop=1000, step=1)
Index(['transaction_id', 'store_id', 'store_name', 'date', 'product_id',
       'product_name', 'quantity', 'unit_price', 'total', 'customer_id',
       'promo_code'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  1000 non-null   int64
 1   store_id        1000 non-null   int64
 2   store_name      1000 non-null   object
 3   date            1000 non-null   object
 4   product_id      1000 non-null   int64
 5   product_name    1000 non-null   object
 6   quantity        1000 non-null   int64
 7   unit_price      1000 non-null   float64
 8   total           1000 non-null   float64
 9   customer_id     491 non-null    float64
 10  promo_code      504 non-null    object
dtypes: float64(3), int64(4), object(4)
memory usage: 86.1+ KB
None

2. Filter and subset rows/columns (e.g., sales for a store, date ranges, high-value
transactions).

In [6]:
# filter by store
df_store1 = df[df["store_id"] == 1]
print(df_store1.head())

sales_store1 = sum(df_store1["total"])
print(f"Sales for store1: {sales_store1}")

    transaction_id  store_id store_name        date  product_id product_name  \
4             1005         1   Downtown  30-10-2025         506  Highlighter
6             1007         1   Downtown  04-10-2025         501     Notebook
8             1009         1   Downtown  18-10-2025         501     Notebook
9             1010         1   Downtown  28-10-2025         503      Stapler
16            1017         1   Downtown  15-10-2025         505       Marker

    quantity  unit_price  total  customer_id promo_code
4          2        0.90    1.8          NaN     DISC10
6          6        3.50   21.0       2165.0        NaN
8          6        3.50   21.0       2164.0        NaN
9         10        5.25   52.5          NaN      DISC5
16         2        1.75    3.5          NaN        NaN
Sales for store1: 3493.7

In [7]:
# store 2
df_store2 = df[df["store_id"] == 2]
print(df_store2.head())

sales_store2 = sum(df_store2["total"])
print(f"Sales for store2: {sales_store2}")

    transaction_id  store_id store_name        date  product_id product_name  \
1             1002         2     Suburb  06-10-2025         506  Highlighter
2             1003         2     Suburb  08-10-2025         504       Folder
7             1008         2     Suburb  19-10-2025         501     Notebook
10            1011         2     Suburb  13-10-2025         501     Notebook
11            1012         2     Suburb  03-10-2025         506  Highlighter

    quantity  unit_price  total  customer_id promo_code
1          2         0.9    1.8       2172.0     DISC10
2          6         1.2    7.2       2134.0        NaN
7          1         3.5    3.5          NaN        NaN
10         7         3.5   24.5       2196.0        NaN
11         2         0.9    1.8          NaN        NaN
Sales for store2: 4544.95

In [8]:
# store 3
df_store3 = df[df["store_id"] == 3]
print(df_store3.head())

sales_store3 = sum(df_store3["total"])
print(f"Sales for store3: {sales_store3}")

    transaction_id  store_id store_name        date  product_id product_name  \
0             1001         3    Airport  12-10-2025         505       Marker
3             1004         3    Airport  01-10-2025         504       Folder
5             1006         3    Airport  22-10-2025         504       Folder
12            1013         3    Airport  30-10-2025         501     Notebook
13            1014         3    Airport  28-10-2025         502          Pen

    quantity  unit_price  total  customer_id promo_code
0          3        1.75   5.25          NaN        NaN
3          5        1.20   6.00       2137.0     DISC10
5         10        1.20  12.00          NaN      DISC5
12         2        3.50   7.00       2077.0        NaN
13         1        0.80   0.80          NaN        NaN
Sales for store3: 4039.9

In [9]:
# filter by date ranges
# convert to datetime dtype
df["date"] = pd.to_datetime(df["date"], format="mixed", dayfirst=True)
start_date = "2025-10-05"
end_date = "2025-10-07"
df_date_range = df[
    (df["date"] >= start_date) &
    (df["date"] <= end_date)
]
df_date_range

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
1,1002,2,Suburb,2025-10-06,506,Highlighter,2,0.9,1.8,2172.0,DISC10
15,1016,3,Airport,2025-10-06,501,Notebook,9,3.5,31.5,NaN,NaN
23,1024,2,Suburb,2025-10-06,504,Folder,2,1.2,2.4,NaN,NaN
24,1025,3,Airport,2025-10-05,502,Pen,7,0.8,5.6,NaN,NaN
35,1036,1,Downtown,2025-10-07,501,Notebook,1,3.5,3.5,NaN,DISC10
...,...,...,...,...,...,...,...,...,...,...,...
950,1951,1,Downtown,2025-10-06,502,Pen,2,0.8,1.6,2190.0,NaN
953,1954,2,Suburb,2025-10-05,504,Folder,4,1.2,4.8,NaN,DISC5
970,1971,2,Suburb,2025-10-06,506,Highlighter,3,0.9,2.7,NaN,DISC10
988,1989,2,Suburb,2025-10-06,504,Folder,7,1.2,8.4,2077.0,NaN
997,1998,1,Downtown,2025-10-05,502,Pen,7,0.8,5.6,NaN,NaN

In [10]:
# filter by year
df_2025 = df[df['date'].dt.year == 2025]
df_2025.head()

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
0,1001,3,Airport,2025-10-12,505,Marker,3,1.75,5.25,NaN,NaN
1,1002,2,Suburb,2025-10-06,506,Highlighter,2,0.90,1.80,2172.0,DISC10
2,1003,2,Suburb,2025-10-08,504,Folder,6,1.20,7.20,2134.0,NaN
3,1004,3,Airport,2025-10-01,504,Folder,5,1.20,6.00,2137.0,DISC10
4,1005,1,Downtown,2025-10-30,506,Highlighter,2,0.90,1.80,NaN,DISC10

In [11]:
# filter october sales (by month)
df_oct = df[df['date'].dt.month == 10] 
df_oct.head()

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
0,1001,3,Airport,2025-10-12,505,Marker,3,1.75,5.25,NaN,NaN
1,1002,2,Suburb,2025-10-06,506,Highlighter,2,0.90,1.80,2172.0,DISC10
2,1003,2,Suburb,2025-10-08,504,Folder,6,1.20,7.20,2134.0,NaN
3,1004,3,Airport,2025-10-01,504,Folder,5,1.20,6.00,2137.0,DISC10
4,1005,1,Downtown,2025-10-30,506,Highlighter,2,0.90,1.80,NaN,DISC10

In [12]:
# filter high value transactions
df_high_value = df[df["total"] > 20]
df_high_value

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
6,1007,1,Downtown,2025-10-04,501,Notebook,6,3.50,21.00,2165.0,NaN
8,1009,1,Downtown,2025-10-18,501,Notebook,6,3.50,21.00,2164.0,NaN
9,1010,1,Downtown,2025-10-28,503,Stapler,10,5.25,52.50,NaN,DISC5
10,1011,2,Suburb,2025-10-13,501,Notebook,7,3.50,24.50,2196.0,NaN
15,1016,3,Airport,2025-10-06,501,Notebook,9,3.50,31.50,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
974,1975,3,Airport,2025-10-21,503,Stapler,7,5.25,36.75,2050.0,NaN
976,1977,3,Airport,2025-10-12,503,Stapler,8,5.25,42.00,NaN,DISC5
980,1981,2,Suburb,2025-10-16,503,Stapler,5,5.25,26.25,NaN,DISC10
987,1988,1,Downtown,2025-10-28,501,Notebook,6,3.50,21.00,2115.0,NaN
994,1995,1,Downtown,2025-10-16,503,Stapler,5,5.25,26.25,2026.0,NaN

In [13]:
#filter low value transactions
df_low_value = df[df["total"]<5]
df_low_value

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
1,1002,2,Suburb,2025-10-06,506,Highlighter,2,0.9,1.8,2172.0,DISC10
4,1005,1,Downtown,2025-10-30,506,Highlighter,2,0.9,1.8,NaN,DISC10
7,1008,2,Suburb,2025-10-19,501,Notebook,1,3.5,3.5,NaN,NaN
11,1012,2,Suburb,2025-10-03,506,Highlighter,2,0.9,1.8,NaN,NaN
13,1014,3,Airport,2025-10-28,502,Pen,1,0.8,0.8,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
989,1990,1,Downtown,2025-10-03,506,Highlighter,4,0.9,3.6,2053.0,DISC10
991,1992,2,Suburb,2025-10-13,506,Highlighter,4,0.9,3.6,2088.0,NaN
993,1994,1,Downtown,2025-10-23,506,Highlighter,1,0.9,0.9,NaN,DISC10
998,1999,2,Suburb,2025-10-25,504,Folder,3,1.2,3.6,NaN,DISC10
999,2000,2,Suburb,2025-10-22,506,Highlighter,4,0.9,3.6,2171.0,NaN

In [14]:
# filter by product
df_pen = df[df["product_name"] == "Pen"]
print("Pen sales:\n", df_pen.head())

df_stapler = df[df['product_name'] == 'Stapler']
print("Stapler sales:\n", df_stapler.head())

Pen sales:
     transaction_id  store_id store_name       date  product_id product_name  \
13            1014         3    Airport 2025-10-28         502          Pen
19            1020         3    Airport 2025-10-27         502          Pen
24            1025         3    Airport 2025-10-05         502          Pen
25            1026         3    Airport 2025-10-11         502          Pen
36            1037         3    Airport 2025-10-29         502          Pen

    quantity  unit_price  total  customer_id promo_code
13         1         0.8    0.8          NaN        NaN
19         6         0.8    4.8       2052.0      DISC5
24         7         0.8    5.6          NaN        NaN
25         6         0.8    4.8       2026.0        NaN
36         7         0.8    5.6          NaN        NaN
Stapler sales:
     transaction_id  store_id store_name       date  product_id product_name  \
9             1010         1   Downtown 2025-10-28         503      Stapler
14            1015         2     Suburb 2025-10-16         503      Stapler
21            1022         2     Suburb 2025-10-12         503      Stapler
30            1031         3    Airport 2025-10-26         503      Stapler
46            1047         3    Airport 2025-10-06         503      Stapler

    quantity  unit_price  total  customer_id promo_code
9         10        5.25  52.50          NaN      DISC5
14         1        5.25   5.25          NaN        NaN
21         3        5.25  15.75          NaN     DISC10
30         5        5.25  26.25          NaN        NaN
46        10        5.25  52.50       2128.0      DISC5

In [15]:
# filter by promo code
df_with_promo = df[df["promo_code"] != "NO_PROMO"] 
# displays all sales which used promo code
df_with_promo

,transaction_id,store_id,store_name,date,product_id,product_name,quantity,unit_price,total,customer_id,promo_code
0,1001,3,Airport,2025-10-12,505,Marker,3,1.75,5.25,NaN,NaN
1,1002,2,Suburb,2025-10-06,506,Highlighter,2,0.90,1.80,2172.0,DISC10
2,1003,2,Suburb,2025-10-08,504,Folder,6,1.20,7.20,2134.0,NaN
3,1004,3,Airport,2025-10-01,504,Folder,5,1.20,6.00,2137.0,DISC10
4,1005,1,Downtown,2025-10-30,506,Highlighter,2,0.90,1.80,NaN,DISC10
...,...,...,...,...,...,...,...,...,...,...,...
995,1996,1,Downtown,2025-10-14,505,Marker,3,1.75,5.25,2090.0,NaN
996,1997,2,Suburb,2025-10-15,504,Folder,5,1.20,6.00,2198.0,NaN
997,1998,1,Downtown,2025-10-05,502,Pen,7,0.80,5.60,NaN,NaN
998,1999,2,Suburb,2025-10-25,504,Folder,3,1.20,3.60,NaN,DISC10
999,2000,2,Suburb,2025-10-22,506,Highlighter,4,0.90,3.60,2171.0,NaN

In [16]:
# filter by columns
df_subset_cols = df[["date", "store_name", "product_name", "total"]]
df_subset_cols

          date store_name product_name  total
0   2025-10-12    Airport       Marker   5.25
1   2025-10-06     Suburb  Highlighter   1.80
2   2025-10-08     Suburb       Folder   7.20
3   2025-10-01    Airport       Folder   6.00
4   2025-10-30   Downtown  Highlighter   1.80
..         ...        ...          ...    ...
995 2025-10-14   Downtown       Marker   5.25
996 2025-10-15     Suburb       Folder   6.00
997 2025-10-05   Downtown          Pen   5.60
998 2025-10-25     Suburb       Folder   3.60
999 2025-10-22     Suburb  Highlighter   3.60

[1000 rows x 4 columns]

3. Compute descriptive statistics and group summaries (totals by store, average basket).

In [17]:
df.describe() # basic stats for all numeric columns

,transaction_id,store_id,date,product_id,quantity,unit_price,total,customer_id
count,1000.000000,1000.000000,1000,1000.000000,1000.000000,1000.000000,1000.000000,491.000000
mean,1500.500000,1.992000,2025-10-16 00:10:04.800000,503.570000,5.414000,2.209300,12.078550,2099.629328
min,1001.000000,1.000000,2025-10-01 00:00:00,501.000000,1.000000,0.800000,0.800000,2001.000000
25%,1250.750000,1.000000,2025-10-08 18:00:00,502.000000,3.000000,0.900000,3.600000,2050.500000
50%,1500.500000,2.000000,2025-10-16 00:00:00,504.000000,5.000000,1.200000,7.200000,2104.000000
75%,1750.250000,3.000000,2025-10-24 00:00:00,505.000000,8.000000,3.500000,15.750000,2145.500000
max,2000.000000,3.000000,2025-10-31 00:00:00,506.000000,10.000000,5.250000,52.500000,2200.000000
std,288.819436,0.794082,NaN,1.710563,2.953528,1.625317,11.977767,57.245738

In [18]:
# average basket
print("Min total:", df["total"].min())
print("Max total:", df["total"].max())
print("Avg total:", df["total"].mean())

Min total: 0.8
Max total: 52.5
Avg total: 12.078550000000002

In [19]:
print("Min unit price:", df["unit_price"].min())
print("Max unit price:", df["unit_price"].max())
print("Avg unit price:", df["unit_price"].mean())

Min unit price: 0.8
Max unit price: 5.25
Avg unit price: 2.2093

In [20]:
# total sales by store
sales_by_store = df.groupby("store_name")["total"].sum()
sales_by_store

store_name
Airport     4039.90
Downtown    3493.70
Suburb      4544.95
Name: total, dtype: float64

In [21]:
summary_store = df.groupby(["store_id", "store_name"]).agg(
    total_sales=("total", "sum"),
    num_transactions=("transaction_id", "count"),
    avg_sales=("total", "mean")
)
print(summary_store)

                     total_sales  num_transactions  avg_sales
store_id store_name
1        Downtown        3493.70               319  10.952038
2        Suburb          4544.95               370  12.283649
3        Airport         4039.90               311  12.990032

In [22]:
total_sales_by_product = df.groupby("product_name")["total"].sum()
print(total_sales_by_product)

product_name
Folder         1020.00
Highlighter     855.00
Marker         1680.00
Notebook       3157.00
Pen             688.80
Stapler        4677.75
Name: total, dtype: float64

4. Perform simple cleaning (handle missing values, fix data types, drop duplicates).

In [23]:
# checking for duplicate values
df.isnull().sum()

transaction_id      0
store_id            0
store_name          0
date                0
product_id          0
product_name        0
quantity            0
unit_price          0
total               0
customer_id       509
promo_code        496
dtype: int64

In [24]:
import numpy as np
# filling in missing promo_code
df["promo_code"] = df["promo_code"].fillna("NO_PROMO")

# filling in missing customer_id and convert to int64
df["customer_id"] = df["customer_id"].replace("", np.nan)
df["customer_id"] = df["customer_id"].fillna(0).astype("Int64")

# convert to datetime dtype
df["date"] = pd.to_datetime(df["date"])

print(df.dtypes)
print(df.isnull().sum())

transaction_id             int64
store_id                   int64
store_name                object
date              datetime64[ns]
product_id                 int64
product_name              object
quantity                   int64
unit_price               float64
total                    float64
customer_id                Int64
promo_code                object
dtype: object
transaction_id    0
store_id          0
store_name        0
date              0
product_id        0
product_name      0
quantity          0
unit_price        0
total             0
customer_id       0
promo_code        0
dtype: int64

In [25]:
dupes = df.duplicated().sum()
print("No. of duplicated records: ",dupes)

# df.drop_duplicates(inplace=True)

No. of duplicated records:  0

5.Build a mini ETL pipeline: read CSV → clean & transform → output JSON.

In [26]:
import json
df.to_json("cleaned_transactions.json", orient="records", date_format="iso", indent=4)

with open("cleaned_transactions.json") as f:
    data = json.load(f)

print(data[0]) # print first record

{'transaction_id': 1001, 'store_id': 3, 'store_name': 'Airport', 'date': '2025-10-12T00:00:00.000', 'product_id': 505, 'product_name': 'Marker', 'quantity': 3, 'unit_price': 1.75, 'total': 5.25, 'customer_id': 0, 'promo_code': 'NO_PROMO'}